The TF plan for prod-sbx
```
  # module.stateless.module.fhir_lb.aws_elb.main must be replaced
-/+ resource "aws_elb" "main" {
      ~ arn                         = "arn:aws:elasticloadbalancing:us-east-1:577373831711:loadbalancer/bfd-prod-sbx-fhir" -> (known after apply)
      ~ availability_zones          = [
          - "us-east-1a",
          - "us-east-1b",
          - "us-east-1c",
        ] -> (known after apply)
        connection_draining         = true
        connection_draining_timeout = 60
        cross_zone_load_balancing   = false
      ~ dns_name                    = "internal-bfd-prod-sbx-fhir-1922876557.us-east-1.elb.amazonaws.com" -> (known after apply)
      ~ id                          = "bfd-prod-sbx-fhir" -> (known after apply)
        idle_timeout                = 60
      ~ instances                   = [
          - "i-035be7aa96b6aed02",
          - "i-0d09701ddb00d6aa5",
          - "i-0e22cb01af154bc66",
        ] -> (known after apply)
      ~ internal                    = true -> false # forces replacement
      ~ name                        = "bfd-prod-sbx-fhir" -> "bfd-prod-sbx-fhir-public" # forces replacement
        security_groups             = [
            "sg-05bb466a376bca3b3",
        ]
      ~ source_security_group       = "577373831711/bfd-prod-sbx-fhir-lb" -> (known after apply)
      ~ source_security_group_id    = "sg-05bb466a376bca3b3" -> (known after apply)
        subnets                     = [
            "subnet-02cc4a4e8d5ffdb11",
            "subnet-0c78ef1670dccb1da",
            "subnet-0fc4374e606087aac",
        ]
        tags                        = {
            "Environment" = "prod-sbx"
            "Layer"       = "dmz"
            "application" = "bfd"
            "business"    = "oeda"
            "role"        = "fhir"
            "stack"       = "prod-sbx"
        }
      ~ zone_id                     = "Z35SXDOTRQ7X7K" -> (known after apply)

        access_logs {
            bucket        = "bfd-prod-sbx-logs-577373831711"
            bucket_prefix = "fhir_elb_access_logs"
            enabled       = false
            interval      = 5
        }

        health_check {
            healthy_threshold   = 5
            interval            = 10
            target              = "TCP:7443"
            timeout             = 5
            unhealthy_threshold = 2
        }

      + listener {
          + instance_port     = 7443
          + instance_protocol = "TCP"
          + lb_port           = 443
          + lb_protocol       = "TCP"
        }
      - listener {
          - instance_port     = 7443 -> null
          - instance_protocol = "tcp" -> null
          - lb_port           = 443 -> null
          - lb_protocol       = "tcp" -> null
        }
    }

  # module.stateless.module.fhir_lb.aws_security_group.lb will be updated in-place
  ~ resource "aws_security_group" "lb" {
        arn                    = "arn:aws:ec2:us-east-1:577373831711:security-group/sg-05bb466a376bca3b3"
        description            = "Allow access to the fhir load-balancer"
        egress                 = [
            {
                cidr_blocks      = [
                    "10.252.16.0/21",
                ]
                description      = "To VPC instances"
                from_port        = 7443
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 7443
            },
        ]
        id                     = "sg-05bb466a376bca3b3"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Public Internet access"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "10.234.240.0/22",
                  - "10.234.252.0/22",
                  - "10.233.20.0/22",
                  - "10.133.148.0/22",
                  - "10.224.78.0/23",
                  - "10.246.44.0/23",
                  - "10.224.90.0/23",
                  - "10.244.24.0/21",
                  - "10.247.0.0/21",
                  - "10.252.32.0/22",
                  - "10.246.188.0/22",
                  - "10.224.108.0/22",
                  - "10.252.40.0/21",
                  - "10.252.16.0/21",
                ]
              - description      = "From VPC peerings, the MGMT VPC, and self"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ]
        name                   = "bfd-prod-sbx-fhir-lb"
        owner_id               = "577373831711"
        revoke_rules_on_delete = false
        tags                   = {
            "Environment" = "prod-sbx"
            "Layer"       = "dmz"
            "Name"        = "bfd-prod-sbx-fhir-lb"
            "application" = "bfd"
            "business"    = "oeda"
            "role"        = "fhir"
            "stack"       = "prod-sbx"
        }
        vpc_id                 = "vpc-0c891bb57e955f825"
    }

Plan: 1 to add, 1 to change, 1 to destroy.

------------------------------------------------------------------------
```